%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%  Функция поверхности баллона на основе полинома в полярных координатах  %
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function [r, ru, ruu, rv, rvv, ruv] = surface_r_b(u, v)
RO_phi = [-200.4096721343111,2428.8709925850990,-11585.7546890810463,27152.4105364360366,-31195.5446114188999,14397.6607910855146]; % полином интерполяции r(φ)
ROp_phi = [-1002.0483606715552,9715.4839703403959,-34757.2640672431371,54304.8210728720733,-31195.5446114188999];
ROpp_phi = [-4008.1934426862208,29146.4519110211877,-69514.5281344862742,54304.8210728720733];
PHI_u = [0.0000000000176,-0.0000000319663,0.0000178315076,-0.0066486075257,2.9473869159379]; % полином параметризации φ(u)
PHIp_u = [0.0000000000704,-0.0000000958989,0.0000356630152,-0.0066486075257];
PHIpp_u = [0.0000000002113,-0.0000001917979,0.0000356630152];
a = 0; % начало баллона
b = 327.978; % 1-е сечение
c = 627.978; % 2-е сечение
d = 955.956; % конец баллона
    % !!! ДОБАВИТЬ ИНИЦИАЛИЗАЦИЮ !!!
    % o = zeros(size(u));
    % op = zeros(size(u));
    % opp = zeros(size(u));
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    %% Определяем принадлежность входных значений u к одному из сегментов
    idx1 = find(u >= a & u <= b); % выделяем границы 1-го сегмента
    idx2 = find(u > b  & u < c ); % выделяем границы 2-го сегмента
    idx3 = find(u >= c & u <= (d + 1e-12)); % выделяем границы 3-го сегмента

   %% Определяем принадлежность u к конкретному сегменту и считаем o,op,opp
    if any(idx1)    % Если попадаем в 1-й сегмент, то обсчитываем его
        % Выделяем помножество u, принадлежащитх интервалу №1
            u1 = u(idx1);
        % Считаем PHI (получаем значения PHI по значениям u)
            PHI = polyval(PHI_u,u1);
        % Считаем RO по полученным значениям PHI
            RO = polyval(RO_phi, PHI);
        % Считаем значения o1 (они же y образующей) на основе RO и PHI
            o(idx1) = RO.*sin(PHI);
        % Считаем значения PHIp и PHIpp
            PHIp(idx1)  = polyval(PHIp_u, u1);
            PHIpp(idx1) = polyval(PHIpp_u, u1);

        % Считаем значения ROp и ROpp
            ROp  = polyval(ROp_phi, PHI);
            ROpp = polyval(ROpp_phi, PHI);

        % Считаем значения o1p и o1pp на основе RO и PHI
            op(idx1)  = PHIp.*(ROp.*sin(PHI) + RO.*cos(PHI));
            opp(idx1) = PHIpp.*(ROp.*sin(PHI) + RO.*cos(PHI)) + ...
                  (PHIp).^2.*(ROpp.*sin(PHI)+2*ROp.*cos(PHI)-RO.*sin(PHI));
    end

    if any(idx2)    % Если попадаем в 2-й сегмент, то обсчитываем его
        % Выделяем помножество u, принадлежащитх интервалу №2
            u2 = u(idx2);
        % Считаем значения o2, o2p и o2pp
            o(idx2) = 352.3869999999720; % радиус цилиндра
            op(idx2) = 0;
            opp(idx2) = 0;
    end

    if any(idx3)        % Если попадаем в 3-й сегмент, то обсчитываем его
            % Выделяем помножество u, принадлежащитх интервалу №3
            u3 = u(idx3);
            u3_sym = a + d - u3;  % зеркальные точки
            % Вычислить o, op, opp для u3_sym, как в сегменте 1
            PHI = polyval(PHI_u, u3_sym);
            RO = polyval(RO_phi, PHI);
            o(idx3) = RO .* sin(PHI);

            PHIp = polyval(PHIp_u, u3_sym);
            PHIpp = polyval(PHIpp_u, u3_sym);

            ROp = polyval(ROp_phi, PHI);
            ROpp = polyval(ROpp_phi, PHI);

            temp = ROp .* sin(PHI) + RO .* cos(PHI);
            temp2 = ROpp .* sin(PHI) + 2*ROp .* cos(PHI) - RO .* sin(PHI);

            op(idx3) = - PHIp .* temp;
            opp(idx3) = PHIp.^2 .* temp2 + PHIpp .* temp;

    end

    %% Обнуляем значения производных, которые меньше значения itZero
        itZero = 1e-12;

        op(abs(op) < itZero) = 0;
        opp(abs(opp) < itZero) = 0;

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

    %% Рассчитываем координаты и частные производные радиус-вектора

    %% Координаты радиус-вектора
    r  = [  o.* cos(v);
            o.* sin(v);
            u             ];

    %% Первая производная по u: ru = ∂r/∂u
    ru = [  op.* cos(v);
            op.* sin(v);
            ones(size(u)) ];

    %% Вторая производная по u: ruu = ∂^2r/∂u^2
    ruu = [ opp.* cos(v);
            opp.* sin(v);
            zeros(size(u))];

    %% Первая производная по v: rv = ∂r/∂v
    rv = [ -o.* sin(v);
            o.* cos(v);
            zeros(size(u))];

    %% Вторая производная по v: rvv = ∂^2r/∂v^2
    rvv = [-o.* cos(v);
           -o.* sin(v);
            zeros(size(u))];

    %% Смешанная производная: ruv = ∂^2r/∂u∂v
    ruv = [-op.* sin(v);
            op.* cos(v);
            zeros(size(u))];
end
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
