%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%  Функция поверхности баллона на основе полинома в полярных координатах  %
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function [r, ru, ruu, rv, rvv, ruv] = surface_r(u, v)
RO_phi = [-344.1468891010463,3932.5139101580062,-17756.7012553763525,39582.6812110246392,-43518.6731429065403,19122.1758646943599]; % полином интерполяции r(φ)
ROp_phi = [-1720.7344455052316,15730.0556406320247,-53270.1037661290611,79165.3624220492784,-43518.6731429065403];
ROpp_phi = [-6882.9377820209265,47190.1669218960742,-106540.2075322581222,79165.3624220492784];
PHI_u = [0.0000000005642,-0.0000003012748,0.0000605882383,-0.0099656628535,2.9503573330764]; % полином параметризации φ(u)
PHIp_u = [0.0000000022570,-0.0000009038243,0.0001211764766,-0.0099656628535];
PHIpp_u = [0.0000000067709,-0.0000018076486,0.0001211764766];
a = 0; % начало баллона
b = 234.27; % 1-е сечение
c = 534.27; % 2-е сечение
d = 768.54; % конец баллона
    % !!! ДОБАВИТЬ ИНИЦИАЛИЗАЦИЮ !!!
    % o = zeros(size(u));
    % op = zeros(size(u));
    % opp = zeros(size(u));
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    %% Определяем принадлежность входных значений u к одному из сегментов
    idx1 = find(u >= a & u <= b); % выделяем границы 1-го сегмента
    idx2 = find(u > b  & u < c ); % выделяем границы 2-го сегмента
    idx3 = find(u >= c & u <= d); % выделяем границы 3-го сегмента

   %% Определяем принадлежность u к конкретному сегменту и считаем o,op,opp
    if any(idx1)    % Если попадаем в 1-й сегмент, то обсчитываем его
        % Выделяем помножество u, принадлежащитх интервалу №1
            u1 = u(idx1);
        % Считаем PHI (получаем значения PHI по значениям u)
            PHI = polyval(PHI_u,u1);
        % Считаем RO по полученным значениям PHI
            RO = polyval(RO_phi, PHI);
        % Считаем значения o1 (они же y образующей) на основе RO и PHI
            o(idx1) = RO.*sin(PHI);
        % Считаем значения PHIp и PHIpp
            PHIp(idx1)  = polyval(PHIp_u, u1);
            PHIpp(idx1) = polyval(PHIpp_u, u1);

        % Считаем значения ROp и ROpp
            ROp  = polyval(ROp_phi, PHI);
            ROpp = polyval(ROpp_phi, PHI);

        % Считаем значения o1p и o1pp на основе RO и PHI
            op(idx1)  = PHIp.*(ROp.*sin(PHI) + RO.*cos(PHI));
            opp(idx1) = PHIpp.*(ROp.*sin(PHI) + RO.*cos(PHI)) + ...
                  (PHIp).^2.*(ROpp.*sin(PHI)+2*ROp.*cos(PHI)-RO.*sin(PHI));
    end

    if any(idx2)    % Если попадаем в 2-й сегмент, то обсчитываем его
        % Выделяем помножество u, принадлежащитх интервалу №2
            u2 = u(idx2);
        % Считаем значения o2, o2p и o2pp
            o(idx2) = 251.7050000000000; % радиус цилиндра
            op(idx2) = 0;
            opp(idx2) = 0;
    end

    if any(idx3)        % Если попадаем в 3-й сегмент, то обсчитываем его
            % Выделяем помножество u, принадлежащитх интервалу №3
            u3 = u(idx3);
            u3_sym = a + d - u3;  % зеркальные точки
            % Вычислить o, op, opp для u3_sym, как в сегменте 1
            PHI = polyval(PHI_u, u3_sym);
            RO = polyval(RO_phi, PHI);
            o(idx3) = RO .* sin(PHI);

            PHIp = polyval(PHIp_u, u3_sym);
            PHIpp = polyval(PHIpp_u, u3_sym);

            ROp = polyval(ROp_phi, PHI);
            ROpp = polyval(ROpp_phi, PHI);

            temp = ROp .* sin(PHI) + RO .* cos(PHI);
            temp2 = ROpp .* sin(PHI) + 2*ROp .* cos(PHI) - RO .* sin(PHI);

            op(idx3) = - PHIp .* temp;
            opp(idx3) = PHIp.^2 .* temp2 + PHIpp .* temp;

    end

    %% Обнуляем значения производных, которые меньше значения itZero
        itZero = 1e-12;

        op(abs(op) < itZero) = 0;
        opp(abs(opp) < itZero) = 0;

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

    %% Рассчитываем координаты и частные производные радиус-вектора

    %% Координаты радиус-вектора
    r  = [  o.* cos(v);
            o.* sin(v);
            u             ];

    %% Первая производная по u: ru = ∂r/∂u
    ru = [  op.* cos(v);
            op.* sin(v);
            ones(size(u)) ];

    %% Вторая производная по u: ruu = ∂^2r/∂u^2
    ruu = [ opp.* cos(v);
            opp.* sin(v);
            zeros(size(u))];

    %% Первая производная по v: rv = ∂r/∂v
    rv = [ -o.* sin(v);
            o.* cos(v);
            zeros(size(u))];

    %% Вторая производная по v: rvv = ∂^2r/∂v^2
    rvv = [-o.* cos(v);
           -o.* sin(v);
            zeros(size(u))];

    %% Смешанная производная: ruv = ∂^2r/∂u∂v
    ruv = [-op.* sin(v);
            op.* cos(v);
            zeros(size(u))];
end
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
